docs/assign10.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-07 Wed 14:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 Assignment 10</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 Assignment 10</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org63cf9c2">1. Goals: Favoring composition over inheritance. Bloch, Item 18.</a></li>
<li><a href="#org8c9fae2">2. Grading Criteria</a></li>
<li><a href="#org723c7c4">3. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org63cf9c2" class="outline-2">
<h2 id="org63cf9c2"><span class="section-number-2">1</span> Goals: Favoring composition over inheritance. Bloch, Item 18.</h2>
<div class="outline-text-2" id="text-1">
<p>
Consider the <code>InstrumentedSet</code> example from Bloch Item 18 (as well as in-class exercise <a href="./inclass10A.html">#10A</a>).
</p>
<ol class="org-ol">
<li>Replace <code>Set</code> with <code>List</code>. There is no problem with <code>equals()</code>. Why not?</li>
<li>Replace <code>Set</code> with <code>Collection</code>. Now <code>equals()</code> does not satisfy its contract.
<ul class="org-ul">
<li>Explain why there is a problem.</li>
<li>Demonstrate the problem with a suitable JUnit test.</li>
</ul></li>
</ol>
</div>
</div>




<div id="outline-container-org8c9fae2" class="outline-2">
<h2 id="org8c9fae2"><span class="section-number-2">2</span> Grading Criteria</h2>
<div class="outline-text-2" id="text-2">
<p>
The GTA will look for correct responses, appropriate JUnit tests, and plausible explanations when doing the grading.
</p>
</div>
</div>


<div id="outline-container-org723c7c4" class="outline-2">
<h2 id="org723c7c4"><span class="section-number-2">3</span> Links</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
